{"keras_version": "2.0.8", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 10, 16, 1000, 1], "name": "input_1", "dtype": "float32"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "PredNet", "config": {"stateful": false, "pixel_max": 1.0, "return_state": false, "error_activation": "relu", "A_filt_sizes": [3, 3, 3], "name": "pred_net_1", "LSTM_inner_activation": "hard_sigmoid", "output_mode": "error", "unroll": false, "implementation": 0, "return_sequences": true, "extrap_start_time": null, "data_format": "channels_last", "R_stack_sizes": [1, 24, 48, 96], "LSTM_activation": "tanh", "stack_sizes": [1, 24, 48, 96], "Ahat_filt_sizes": [3, 3, 3, 3], "go_backwards": false, "trainable": true, "A_activation": "relu", "R_filt_sizes": [3, 3, 3, 3]}, "name": "pred_net_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "units": 1, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_regularizer": null, "name": "dense_1"}}, "name": "time_distributed_1", "trainable": false}, "name": "time_distributed_1", "inbound_nodes": [[["pred_net_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "name": "flatten_1", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear", "units": 1, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": false, "kernel_regularizer": null, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "name": "my_model_1", "output_layers": [["dense_2", 0, 0]]}, "backend": "tensorflow", "class_name": "My_Model"}