{"class_name": "Model", "keras_version": "2.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 10, 128, 160, 3], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "PredNet", "config": {"A_filt_sizes": [3, 3, 3], "LSTM_inner_activation": "hard_sigmoid", "output_mode": "error", "name": "pred_net_1", "error_activation": "relu", "return_state": false, "go_backwards": false, "trainable": true, "stack_sizes": [3, 48, 96, 192], "data_format": "channels_last", "stateful": false, "R_filt_sizes": [3, 3, 3, 3], "unroll": false, "R_stack_sizes": [3, 48, 96, 192], "extrap_start_time": null, "implementation": 0, "A_activation": "relu", "Ahat_filt_sizes": [3, 3, 3, 3], "pixel_max": 1.0, "return_sequences": true, "LSTM_activation": "tanh"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "pred_net_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": false, "name": "time_distributed_1"}, "inbound_nodes": [[["pred_net_1", 0, 0, {}]]], "name": "time_distributed_1"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": false, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}